Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказПокупателя</Name>
		</Properties>
	</Document>
</MetaDataObject>

Enums/уз_СостоянияЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>уз_СостоянияЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/уз_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>уз_Задача</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уз_СостоянияЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура уз_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	уз_СоздатьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура уз_СоздатьЭлементыФормы()
	
	Форма = ЭтотОбъект;
	
	уз_РаботаСФормами.СоздатьКоманду(Форма, "ЗаполнитьЗадачами", "Заполнить задачами", "ЗаполнитьЗадачами");	уз_РаботаСФормами.СздКнопка(Форма, "ЗаполнитьЗадачами", Элементы.ЗапасыКоманднаяПанельКоманды, "Заполнить задачами", "ЗаполнитьЗадачами", 1);
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗаполнитьЗадачами()
	
	Объект.Запасы.Очистить();
    ЗаполнитьЗадачамиНаСервере(); 
		
КонецПроцедуры       

&НаСервере
Процедура ЗаполнитьЗадачамиНаСервере()
	
	НоменклатураУслуга = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("8c87c58c-88d8-11ed-83b2-be845aaabf72"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(уз_Задача.ЧасыФакт) КАК Количество
	               |ИЗ
	               |	Документ.уз_Задача КАК уз_Задача
	               |ГДЕ
	               |	уз_Задача.ЗаказПокупателя = &ЗаказПокупателя
	               |	И уз_Задача.Состояние = ЗНАЧЕНИЕ(Перечисление.уз_СостоянияЗадачи.Выполнена)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ДатаДокумента,
	               |			ВидЦен = &ВидЦен
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказПокупателя", Объект.Ссылка); 
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);    
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураУслуга);
	Запрос.УстановитьПараметр("ВидЦен", Справочники.ВидыЦен.Оптовая);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	ВыборкаЧасы = МассивРезультатов[0].Выбрать();
	Если ВыборкаЧасы.Следующий() Тогда
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = НоменклатураУслуга;
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЧасы);
		
		ВыборкаЦена = МассивРезультатов[1].Выбрать();
		Если ВыборкаЦена.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЦена);
		КонецЕсли; 
		
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
		
	КонецЕсли;
	
КонецПроцедуры
